src/СРМ/src/InformationRegisters/ЦПР_УчетныеДанныеПодключений/ЦПР_УчетныеДанныеПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦПР_УчетныеДанныеПодключений</name>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Администратор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ЦПР_ВидыУчетныхДанных</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПроверкаПодключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТочкаПодключения</name>
    <type>
      <types>CatalogRef.ЦПР_Подключения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/СРМ/src/InformationRegisters/ЦПР_УчетныеДанныеПодключений/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ПоказатьПароль(Команда)
	
	Элементы.Пароль.РежимПароля=Не Элементы.Пароль.РежимПароля;
	Если Элементы.Пароль.РежимПароля Тогда
		Элементы.ПоказатьПароль.Заголовок="Показать пароль";
	Иначе
		Элементы.ПоказатьПароль.Заголовок="Скрыть пароль";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_УчетныеДанныеПодключений");
КонецПроцедуры

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура УстановитьПартнераФормы()
	Партнер=Запись.ТочкаПодключения.Владелец.Партнер;
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", Партнер);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Пользователь.ПараметрыВыбора = НовыеПараметры;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПартнераФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТочкаПодключенияПриИзменении(Элемент)
	УстановитьПартнераФормы();
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти
